/**
 *                                 _oo8oo_
 *                                o8888888o
 *                                88" . "88
 *                                (| -_- |)
 *                                0\  =  /0
 *                              ___/'==='\___
 *                            .' \\|     |// '.
 *                           / \\|||  :  |||// \
 *                          / _||||| -:- |||||_ \
 *                         |   | \\\  -  /// |   |
 *                         | \_|  ''\---/''  |_/ |
 *                         \  .-\__  '-'  __/-.  /
 *                       ___'. .'  /--.--\  '. .'___
 *                    ."" '<  '.___\_<|>_/___.'  >' "".
 *                   | | :  `- \`.:`\ _ /`:.`/ -`  : | |
 *                   \  \ `-.   \_ __\ /__ _/   .-` /  /
 *               =====`-.____`.___ \_____/ ___.`____.-`=====
 *                                 `=---=`

 佛祖保佑         永无bug

 *              ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Created by BBBernie on 2015/1/11.
 */
define([
	'mockjax'
],function(){
	var mockAjax = function(){
		var xinwendongtai;
		var chanpinzixun;

		$.mockjax({
			url: '/getXinwendongtaiList',
			status: 200,
			responseText: {
				status: 0,
				totalPage: 12,
				msg: 'success',
				data: {
					list: [

						{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						}
					]
				}
			}
		})

		$.mockjax({
			url: '/getChanpinzixunList',
			status: 200,
			responseText: {
				status: 0,
				totalPage: 12,
				msg: 'success',
				data: {
					list: [
						{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						},{
							title:'圣诞大酬宾，全场2折，更有好礼相赠。',
							date: '2015年1月11日',
							id: '10002'
						}
					]
				}
			}
		})
	}
	return mockAjax;
})